# FabricSheetWrongHost Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..FabricSheetWrongHost Property
BuiltInFailures..::..FabricFailures Class See Also
---
Fabric Sheet can be placed only in Structural Floors and straight Structural Walls.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricSheetWrongHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricSheetWrongHost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricSheetWrongHost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace